<?xml version="1.0"?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data shape="1,60" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input.1">
					<dim>1</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="embed.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="21128, 512" offset="0" size="21635072" />
			<output>
				<port id="0" precision="FP16" names="embed.weight">
					<dim>21128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="embed.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>21128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>21128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_15" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="21635072" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="4" name="Gather_0" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>21128</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>60</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="14">
					<dim>1</dim>
					<dim>60</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_17" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="21635080" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="15">
					<dim>60</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_52" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="21635080" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Transpose_53" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>60</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_27_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="21635104" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="10" name="Constant_27" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="11" name="170" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="21635106" size="8" />
			<output>
				<port id="0" precision="I64" names="170">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>60</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="16">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_1340" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="21635114" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_21" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="21635072" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="15" name="Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="18,22">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="171" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="21635122" size="8" />
			<output>
				<port id="0" precision="I64" names="171">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Concat_6" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="24">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="ConstantOfShape_7" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="25">
					<dim>2</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="21635072" size="8" />
			<output>
				<port id="0" precision="I64" names="84">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="21635114" size="8" />
			<output>
				<port id="0" precision="I64" names="85">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Broadcast_36" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="21635114" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Slice_11" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="86,90">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_1406" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="21635130" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Transpose_83" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="ShapeOf_60" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_64" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="21635154" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_61" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="21635158" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Gather_65" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_62" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="21635158" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Gather_63" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Broadcast_77" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Concat_56_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 400, 512" offset="21635162" size="409600" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Concat_56" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Concat_59_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 400, 100" offset="22044762" size="80000" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Concat_59" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Concat_76_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 400" offset="22124762" size="800" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Concat_76" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="LSTMSequence_91" type="LSTMSequence" version="opset5">
			<data direction="forward" hidden_size="100" activations="sigmoid, tanh, tanh" activations_alpha="" activations_beta="" clip="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>512</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>100</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>60</dim>
					<dim>100</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_1372" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="21635114" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Squeeze_1373" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>60</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_23" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="21635114" size="8" />
			<output>
				<port id="0" precision="I64" names="156">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_24" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="21635106" size="8" />
			<output>
				<port id="0" precision="I64" names="157">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Broadcast_115" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="21635114" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Slice_25" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="154,158">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_1414" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="21635130" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Transpose_152" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="ShapeOf_129" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_133" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="21635154" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_130" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="21635158" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Gather_134" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_131" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="21635158" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Gather_132" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Broadcast_146" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Concat_125_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 400, 100" offset="22125562" size="80000" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Concat_125" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Concat_128_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 400, 100" offset="22205562" size="80000" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Concat_128" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Concat_145_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 400" offset="22285562" size="800" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Concat_145" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="LSTMSequence_160" type="LSTMSequence" version="opset5">
			<data direction="forward" hidden_size="100" activations="sigmoid, tanh, tanh" activations_alpha="" activations_beta="" clip="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>100</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>100</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>60</dim>
					<dim>100</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_1379" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="21635114" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Squeeze_1380" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>60</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_1381" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="21635080" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Squeeze_27" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="162">
					<dim>60</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_29" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="22286362" size="8" />
			<output>
				<port id="0" precision="I64" names="164">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_30" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="22286370" size="8" />
			<output>
				<port id="0" precision="I64" names="165">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Broadcast_174" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="21635114" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Slice_31" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>60</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="166">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_179" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="21635072" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Squeeze_32" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="167">
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="linear.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="10, 100" offset="22286378" size="2000" />
			<output>
				<port id="0" precision="FP16" names="linear.weight">
					<dim>10</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="linear.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>10</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Gemm_33/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>10</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_1449_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 10" offset="22288378" size="20" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_1449" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Gemm_33" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="168">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="linear1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 10" offset="22288398" size="40" />
			<output>
				<port id="0" precision="FP16" names="linear1.weight">
					<dim>2</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="linear1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Gemm_34/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_1450_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 2" offset="22288438" size="4" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_1450" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="169" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="169">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="169/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="4" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="2" />
		<edge from-layer="4" from-port="3" to-layer="6" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="6" from-port="2" to-layer="8" to-port="0" />
		<edge from-layer="6" from-port="2" to-layer="12" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="25" to-port="0" />
		<edge from-layer="8" from-port="2" to-layer="38" to-port="0" />
		<edge from-layer="9" from-port="0" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="17" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="15" to-port="1" />
		<edge from-layer="14" from-port="0" to-layer="15" to-port="2" />
		<edge from-layer="15" from-port="3" to-layer="17" to-port="1" />
		<edge from-layer="16" from-port="0" to-layer="17" to-port="2" />
		<edge from-layer="17" from-port="3" to-layer="18" to-port="1" />
		<edge from-layer="18" from-port="2" to-layer="22" to-port="0" />
		<edge from-layer="18" from-port="2" to-layer="44" to-port="0" />
		<edge from-layer="19" from-port="0" to-layer="22" to-port="1" />
		<edge from-layer="20" from-port="0" to-layer="22" to-port="2" />
		<edge from-layer="21" from-port="0" to-layer="22" to-port="3" />
		<edge from-layer="22" from-port="4" to-layer="24" to-port="0" />
		<edge from-layer="23" from-port="0" to-layer="24" to-port="1" />
		<edge from-layer="24" from-port="2" to-layer="38" to-port="1" />
		<edge from-layer="24" from-port="2" to-layer="38" to-port="2" />
		<edge from-layer="25" from-port="1" to-layer="30" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="28" to-port="0" />
		<edge from-layer="26" from-port="0" to-layer="28" to-port="1" />
		<edge from-layer="27" from-port="0" to-layer="28" to-port="2" />
		<edge from-layer="27" from-port="0" to-layer="30" to-port="2" />
		<edge from-layer="28" from-port="3" to-layer="31" to-port="0" />
		<edge from-layer="29" from-port="0" to-layer="30" to-port="1" />
		<edge from-layer="30" from-port="3" to-layer="31" to-port="1" />
		<edge from-layer="31" from-port="2" to-layer="38" to-port="3" />
		<edge from-layer="32" from-port="0" to-layer="33" to-port="0" />
		<edge from-layer="33" from-port="1" to-layer="38" to-port="4" />
		<edge from-layer="34" from-port="0" to-layer="35" to-port="0" />
		<edge from-layer="35" from-port="1" to-layer="38" to-port="5" />
		<edge from-layer="36" from-port="0" to-layer="37" to-port="0" />
		<edge from-layer="37" from-port="1" to-layer="38" to-port="6" />
		<edge from-layer="38" from-port="7" to-layer="40" to-port="0" />
		<edge from-layer="39" from-port="0" to-layer="40" to-port="1" />
		<edge from-layer="40" from-port="2" to-layer="47" to-port="0" />
		<edge from-layer="40" from-port="2" to-layer="60" to-port="0" />
		<edge from-layer="41" from-port="0" to-layer="44" to-port="1" />
		<edge from-layer="42" from-port="0" to-layer="44" to-port="2" />
		<edge from-layer="43" from-port="0" to-layer="44" to-port="3" />
		<edge from-layer="44" from-port="4" to-layer="46" to-port="0" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="1" />
		<edge from-layer="46" from-port="2" to-layer="60" to-port="1" />
		<edge from-layer="46" from-port="2" to-layer="60" to-port="2" />
		<edge from-layer="47" from-port="1" to-layer="50" to-port="0" />
		<edge from-layer="47" from-port="1" to-layer="52" to-port="0" />
		<edge from-layer="48" from-port="0" to-layer="50" to-port="1" />
		<edge from-layer="49" from-port="0" to-layer="50" to-port="2" />
		<edge from-layer="49" from-port="0" to-layer="52" to-port="2" />
		<edge from-layer="50" from-port="3" to-layer="53" to-port="0" />
		<edge from-layer="51" from-port="0" to-layer="52" to-port="1" />
		<edge from-layer="52" from-port="3" to-layer="53" to-port="1" />
		<edge from-layer="53" from-port="2" to-layer="60" to-port="3" />
		<edge from-layer="54" from-port="0" to-layer="55" to-port="0" />
		<edge from-layer="55" from-port="1" to-layer="60" to-port="4" />
		<edge from-layer="56" from-port="0" to-layer="57" to-port="0" />
		<edge from-layer="57" from-port="1" to-layer="60" to-port="5" />
		<edge from-layer="58" from-port="0" to-layer="59" to-port="0" />
		<edge from-layer="59" from-port="1" to-layer="60" to-port="6" />
		<edge from-layer="60" from-port="7" to-layer="62" to-port="0" />
		<edge from-layer="61" from-port="0" to-layer="62" to-port="1" />
		<edge from-layer="62" from-port="2" to-layer="64" to-port="0" />
		<edge from-layer="63" from-port="0" to-layer="64" to-port="1" />
		<edge from-layer="64" from-port="2" to-layer="68" to-port="0" />
		<edge from-layer="65" from-port="0" to-layer="68" to-port="1" />
		<edge from-layer="66" from-port="0" to-layer="68" to-port="2" />
		<edge from-layer="67" from-port="0" to-layer="68" to-port="3" />
		<edge from-layer="68" from-port="4" to-layer="70" to-port="0" />
		<edge from-layer="69" from-port="0" to-layer="70" to-port="1" />
		<edge from-layer="70" from-port="2" to-layer="73" to-port="0" />
		<edge from-layer="71" from-port="0" to-layer="72" to-port="0" />
		<edge from-layer="72" from-port="1" to-layer="73" to-port="1" />
		<edge from-layer="73" from-port="2" to-layer="76" to-port="0" />
		<edge from-layer="74" from-port="0" to-layer="75" to-port="0" />
		<edge from-layer="75" from-port="1" to-layer="76" to-port="1" />
		<edge from-layer="76" from-port="2" to-layer="79" to-port="0" />
		<edge from-layer="77" from-port="0" to-layer="78" to-port="0" />
		<edge from-layer="78" from-port="1" to-layer="79" to-port="1" />
		<edge from-layer="79" from-port="2" to-layer="82" to-port="0" />
		<edge from-layer="80" from-port="0" to-layer="81" to-port="0" />
		<edge from-layer="81" from-port="1" to-layer="82" to-port="1" />
		<edge from-layer="82" from-port="2" to-layer="83" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2023.1.0-12185-9e6b00e51cd-releases/2023/1" />
		<conversion_parameters>
			<input_model value="DIR\lstm_model.onnx" />
			<is_python_object value="False" />
		</conversion_parameters>
	</rt_info>
</net>
